// Вам потрібно створити програму, яка мутує значення кожного елемента в масиві за допомогою методу map.

// Ось кроки, які вам потрібно виконати:

// Створіть початковий масив, наприклад, [1, 2, 3, 4, 5].
const randomArr = []
for (let i = 0; i < 10; i++) {
  randomArr.push(Math.floor(Math.random() * 10 - 5))
}

// Створіть новий масив, де кожне значення це елемент вихідного масиву помножений на значення індексу відповідного елемента початкового масиву.
const mutatedArr = randomArr.map((el, index) => el * index)

// Виведіть новий масив на консоль.
console.log(randomArr)
console.log(mutatedArr)