// В цьому завданні вам потрібно використовувати then() та catch() для обробки результатів виконання промісу

// 1. Напишіть функцію яке буде робити запит до серверу за цим ендпоінтом:
// <https://jsonplaceholder.typicode.com/todos/1>

// Функція повинна повертати як результат Promise що повертає об’єкт todo

// 2. Напишіть функцію яке буде робити запит до серверу за цим ендпоінтом

// <https://jsonplaceholder.typicode.com/users/1>

// Функція повинна повертати як результат Promise що повертає об’єкт user

// 3. Викорситайте методи Promise.all та Promise.race передавши їм як аргумент масив з викликами функцій з п.п. 1-2. Присвойте значення отримані від цих виразів до змінних.
